'''暴力破解乐快节宵元*4==元宵节快乐 元宵节快乐分别为五个不同的数字'''
x = 10000
while x <= 25000:
    a = int(x / 10000)
    b = int(x / 1000 - a * 10)
    c = int(x / 100 - a * 100 - b * 10)
    d = int(x / 10 - a * 1000 - b * 100 - c * 10)
    e = int(x - a * 10000 - b * 1000 - c * 100 - d * 10) 
    # 上面求不同位数的代码有待优化  
    if x * 4 == (e * 10000 + d * 1000 + c * 100 + b * 10 + a) :
        print(x)
    x = x + 1
# 优化上面对于数字各个位数取出的代码
x = 10000
while x < 25000:
    a = x // 10000
    b = (x - a * 10000) // 1000
    c = (x - a * 10000 - b * 1000) // 100
    d = (x - a * 10000 - b * 1000 - c * 100) // 10
    e = x % 10
    if x * 4 == (e * 10000 + d * 1000 + c * 100 + b * 10 + a) :
        print(x)
    x = x + 1